app/views/avengers/index.html.erb

SELECT COUNT(*) FROM "avengers"
---

<%= line_chart Avenger.group(:year).count %>