app/controllers/avengers_controller.rb

SELECT  "avengers".* FROM "avengers"  ORDER BY "avengers"."year" ASC LIMIT 24 OFFSET 168
SELECT COUNT(*) FROM "avengers"
---
  def index
    @avengers = Avenger.order(year: :asc).page(params[:page])

SELECT  "avengers".* FROM "avengers" WHERE "avengers"."id" = ? LIMIT 1  [["id", 127]]
---
  def show
    @avenger = Avenger.find(params[:id])